app/services/classifier_service.rb

SELECT "classify_data".* FROM "classify_data"
---
  def load_classify_data
    ClassifyData.all.each do |record|