app/controllers/api/v1/fraud_controller.rb

INSERT INTO "classify_data" ("data", "classification", "created_at", "updated_at") VALUES ('{"Women"=>"Good Men", "Men"=>"Good Women"}', 'Good', '2024-11-10 09:44:49.870971', '2024-11-10 09:44:49.870971') RETURNING "id"
---
      def classify
        data = params.require(:data).permit!.to_h
        classification = params.require(:classification)

        @classifier = ClassifierService.new

        @classifier.classify(data, classification)

        # store payload data for future use
        ClassifyData.create(data: data, classification: classification)